from src.bot.utils.text import Text


s_start_hand_text = Text("""
*Привіт!*

Ти запустив 🤖 *AI Prompt Master* — тренажер, що допоможе тобі стати майстром спілкування зі штучним інтелектом.

_Напиши /help, щоб дізнатися, як користуватися ботом._
""")


s_help_hand_text = Text("""
*ℹ️ Допомога*

Цей бот навчає створювати якісні промпти для ШІ.  
Грай, вчися і прокачуйся разом із ШІ 🤖

🔹 */rules* — правила гри та як все працює *(тільки в головному меню)*
🔹 */authorize* — створити аккаунт *(тільки в головному меню)*
🔹 */delete* — видалити акаунт *(тільки в головному меню)*  
🔹 */profile* — переглянути свій прогрес *(тільки в головному меню)*
🔹 */levels* — переглянути всі рівні *(тільки в головному меню)*
🔹 */achievements* — переглянути всі досягнення *(тільки в головному меню)*
🔹 */quit* — вийти з режиму гри або повернутися в головне меню
🔹 */games* — Переглянути всі ігрові режими та почати гру

_🎮 У режимі гри деякі команди недоступні — повертайся в головне меню, щоб скористатися ними._  
🔐 Для участі в іграх, перегляду статистики, рівнів та досягнень потрібна авторизація.
""")
