from src.bot.utils.text import Text


s_start_hand_text = Text("""
*Привіт!*

Ти запустив 🤖 *AI Prompt Master* — тренажер, що допоможе тобі стати майстром спілкування зі штучним інтелектом.

_Напиши /help, щоб дізнатися, як користуватися ботом._
""")


s_help_hand_text = Text("""
*ℹ️ Допомога*

Цей бот навчає створювати якісні промпти для ШІ.  
Грай, вчися і прокачуйся разом із ШІ 🤖

🔹 */rules* — правила гри та як все працює *(тільки в головному меню)*
🔹 */authorize* — створити аккаунт *(тільки в головному меню)*
🔹 */delete* — видалити акаунт *(тільки в головному меню)*  
🔹 */profile* — переглянути свій прогрес *(тільки в головному меню)*
🔹 */levels* — переглянути всі рівні *(тільки в головному меню)*
🔹 */achievements* — переглянути всі досягнення *(тільки в головному меню)*
🔹 */quit* — вийти з режиму гри або повернутися в головне меню
🔹 */games* — Переглянути всі ігрові режими та почати гру

_🎮 У режимі гри деякі команди недоступні — повертайся в головне меню, щоб скористатися ними._  
🔐 Для участі в іграх, перегляду статистики, рівнів та досягнень потрібна авторизація.
""")


s_levels_hand_text = Text("""
📶 *Усі рівні майстерності*

{% for level in levels %}
{{ loop.index }}. {{ level.emoji }} *{{ level.title }}* — {{ level.requiredScore }} XP
{% endfor %}

Набирай досвід, щоб підніматися вище!
""")


s_achievements_hand_text = Text("""
🏆 *Усі досягнення*

{% for achievement in achievements %}
{{ achievement.emoji }} *{{ achievement.title }}*:
{{ achievement.description }}
{% endfor %}

Розблокуй їх усі!
""")


s_quit_hand_text = Text("""
🏠 Ти повернувся в головне меню. Тепер більшість команд доступні!
""")


e_quit_hand_text = Text("""
⚠️ Ти не в додатковому режимі.
""")


s_rules_hand_text = Text("""
📜 *Правила гри та як усе працює*

Цей бот створений, щоб допомогти тобі навчитися писати якісні та ефективні промпти для штучного інтелекту.

🔸 *Ігрові режими*  
Обирай захопливі режими, в яких ти будеш тренуватися створювати, редагувати або покращувати промпти. Кожна гра — новий виклик!

🔸 *Оцінювання*  
Твої відповіді оцінюються від 1 до 10 балів. Чим кращий промпт — тим більше очок.

🔸 *Прогрес та мотивація*  
Заробляй очки, щоб відкривати нові *рівні* майстерності та здобувати *досягнення*.  
Перевір свій прогрес командою /profile  
Подивися всі рівні: /levels  
Переглянь можливі досягнення: /achievements

🔸 *Поради та аналіз*  
Після кожної гри ти отримаєш зворотний зв’язок: що зроблено добре, що можна покращити, і як зробити промпт ідеальним.

🔸 *Авторизація*  
Для участі в іграх, перегляду статистики, збереження прогресу, рівнів та досягнень потрібна авторизація:  
→ Використай команду /authorize

Вчися, граючи. Розкрий свій потенціал і стань майстром промптів! 💡
""")
