from src.bot.utils.text import Text


s_games_hand_text = Text("""
🎮 *Доступні ігри*

Ось режими, у яких ти можеш тренуватись створювати круті промпти.  
Обери гру та розвивай свої навички ШІ!

_Кожна гра — новий виклик та можливість стати кращим у мистецтві спілкування з ШІ._
""")


e_games_hand_text = Text("""
🔐 *Ігри недоступні*

Щоб грати в ігри, отримувати очки, досягнення та рівні — спершу потрібно авторизуватись.
Використай команду */authorize*, щоб створити аккаунт.
""")


s_games_hand_text_game = Text("""
{{ title }}

🎮 {{ shortDescription }}
""")


s_game_info_hand_text = Text("""
{{ title }}

{{ description }}
""")
