from src.bot.utils.text import Text


s_authorize_hand_text = Text("""
*🔐 Авторизація*

Для збереження твоїх результатів і досягнень потрібна авторизація.

✅ Авторизація пройшла успішно!
""")


e_authorize_hand_text = Text("""
❗ Ви вже авторизовані.

Якщо хочете почати спочатку — скористайтесь командою */delete*
""")


s_delete_command_hand_text = Text("""
⚠️ Ви впевнені, що хочете *видалити акаунт*?

Це призведе до *повного видалення всіх даних*. Повернення буде неможливим.
""")


e_delete_command_hand_text = Text("""
❗ Ви ще *не створили акаунт*.

Спершу скористайтесь командою */authorize*
""")


s_delete_hand_text = Text("""
✅ Ваш акаунт було *успішно видалено*.

Ви можете почати заново, використавши команду */authorize*
""")
