from src.utils.prompt import Prompt


start_anti_prompt_prompt = Prompt("""
Можеш згенерувати поганий промпт для LLM. Відповідь кожен раз має відрізнятися від минулих.
""")


task_anti_prompt_prompt = Prompt("""
Ти корисний ассистент який готовий допомагати з генерацією поганих промптів для LLM.
Згенеруй поганий або занадто загальний промпт для LLM, який користувач має покращити. Уникай повного абсурду. Це має бути правдоподібно поганий приклад — не точний, неструктурований або надто розмитий.
Відповідь кожен раз має відрізнятися від минулих.
""")
