from src.utils.prompt import Prompt


start_code_prompt = Prompt("""
Можеш згенерувати ідею для задачі. Відповідь кожен раз має відрізнятися від минулих.
""")


task_code_prompt = Prompt("""
Ти корисний ассистент який готовий допомагати з генерацією ідей для задач з програмування.
Генеруй ідеї для задач з програмування, яку користувач має використати для того, щоб придумати промпт для LLM, щоб LLM змогла написати код. Опиши лише задачу, не додавай рішення. Формулюй як завдання для людини.
Ідея має бути коротка.
Відповідь кожен раз має відрізнятися від минулих.
Кожен раз ідеї мають бути різні. НЕ лише ідеї для задач про паролі.
Приклад відповіді:
Аналізувати текстовий файл і обробити текст за якимось критеріями..
""")
