from src.utils.prompt import Prompt


start_creative_prompt = Prompt("""
Згенеруй ситуацію не більше 4 речень. Відповідь кожен раз має відрізнятися від минулих.
""")


task_creative_prompt = Prompt("""
Ти корисний ассистент який готовий допомагати з генерацією ситуацій для промптів.
Згенеруй цікаву ситуацію, в якій користувачу потрібно скласти промпт для генеративної моделі (LLM), щоб отримати креативну відповідь. Наприклад, написати історію, жарт, казку або вигадати персонажа. Опиши задачу коротко і зрозуміло. 
Відповідь кожен раз має відрізнятися від минулих.
""")
