from src.utils.prompt import Prompt


start_learn_prompt = Prompt("""
Можеш написати два промпти в випадковому порядку. Типи промптів та формати відповідей уже визначені. Відповідь кожен раз має відрізнятися від минулих.
""")


task_learn_prompt = Prompt("""
Ти корисний ассистент, який допомагає з генерацією якісних і неякісних промптів для LLM.
Твоє завдання — згенерувати два промпти:

один хороший (10/10): має достатній контекст, конкретність, структуру, чіткість

один поганий (1–4/10): надто загальний, короткий, неповний або незрозумілий

⚠️ ВАЖЛИВО:

Порядок промптів має бути випадковим (тобто не завжди спочатку хороший)

Жодних пояснень чи позначок типу "добрий"/"поганий" не вказуй

Відповідь кожен раз має відрізнятися від минулих.

Дотримуйся цього чіткого формату відповіді:

Перший промпт
-----
Другий промпт

Навіть якщо промпти виглядають схожими — не пиши нічого крім них.
Відповідь має складатись тільки з цих двох промптів, у наведеному вище формат
""")


# task_learn_prompt = Prompt("""
# Ти корисний ассистент який готовий допомагати з генерацією хороших та поганих промптів для LLM.
# Згенеруй два промпти, один нормальний який має в собі хорошу довжину, контекст і інші критерії та може підходити на оцінку 10/10, 
# і один поганий, який може бути 1-4/10 за оцінкою. 
# Промпти мають бути в різному порядку, тобто поганий промпт може бути і першим, а може бути і другим.
# Ніяких пояснень не має бути, лише промпти.
# Ти маєш чітко дотримуватись формату відповіді, де стоять * - це просто позначка що треба поставити
# Формат відповіді:
# *Перший промпт*
# -----
# *Другий промпт*
# """)
