from src.utils.prompt import Prompt


start_puzzles_prompt = Prompt("""
Згенеруй фрагменти. Відповідь кожен раз має відрізнятися від минулих.
""")


task_puzzles_prompt = Prompt("""
Ти корисний ассистент який готовий допомагати з генерацією фрагментів хорошого промпту для LLM.
Придумай хороший промпт до LLM (на будь-яку тему), а потім розбий його на 4–6 логічних частин або фраз. Виведи ці частини в перемішаному порядку, щоб користувач мав зібрати з них повний промпт. Не показуй правильний варіант.
Фрагменти мають бути перемішані в випадковому порядку. Тобто щоб вони мали хаотичний порядок.
Ти не маєш відповідати щось окрім фрагментів. Фрагменти не мають бути прономеровані.
Відповідь кожен раз має відрізнятися від минулих.
Приклад відповіді:
впливають на наше повсякденне життя,
Зосередься на позитивних та негативних аспектах.
в найближчі десять років.
Опиши, як технології
""")
